InformationRegisters/СервисСверкиРасчетовУстаревшиеIDУчастниковСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СервисСверкиРасчетовУстаревшиеIDУчастниковСверки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчастникСверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СервисСверкиРасчетовУчастникиСверкиСОбновленнымиID.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СервисСверкиРасчетовУчастникиСверкиСОбновленнымиID</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторДоОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПослеОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчастникСверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ИнтеграцияПодсистемБСС/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область БиблиотекаЭлектронныхДокументов

Процедура ПриОпределенииПодписокНаСобытияБЭД(Подписки) Экспорт
	
	Подписки.БизнесСеть.ПриРегистрацииКонтрагентов              = Истина;
	Подписки.БизнесСеть.ПриИзмененииИдентификаторовКонтрагентов = Истина;
	Подписки.БизнесСеть.ПриИзмененииИдентификаторовОрганизаций  = Истина;
	
КонецПроцедуры

#Область БизнесСеть

// См. БизнесСетьСлужебный.ПриРегистрацииКонтрагентов
Процедура ПриРегистрацииКонтрагентов(Знач Контрагенты) Экспорт

	Если Контрагенты.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Если СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов() Тогда 
		// Если сверка включена, то очистим устаревшие идентификаторы для зарегистрированных контрагентов (если имеются).
		РегистрыСведений.СервисСверкиРасчетовУстаревшиеIDУчастниковСверки.ОчиститьРегистрПоУчастникамСверки(
			Контрагенты.ВыгрузитьКолонку("Контрагент"));
		Возврат;
	КонецЕсли;
	
	// Если сверка отключена, то добавим запись в регистр "Участники сверки с обновленными ID" для пересчета баннеров.
	// Достаточно добавить одну запись в регистр в качестве флага для пересчета.
	НаборЗаписей = РегистрыСведений.СервисСверкиРасчетовУчастникиСверкиСОбновленнымиID.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УчастникСверки.Установить(Контрагенты[0].Контрагент);
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.УчастникСверки               = Контрагенты[0].Контрагент;
	ЗаписьНабора.ИдентификаторПослеОбновления = Контрагенты[0].Идентификатор;
	
	НаборЗаписей.Записать();
	
	// Включим при необходимости рег задание по обработке участников сверки.
	СервисСверкиРасчетов.ОпределитьНеобходимостьОбработкиУчастниковСверки();
	
КонецПроцедуры

// См. БизнесСетьСлужебный.ПриИзмененииИдентификаторовКонтрагентов
Процедура ПриИзмененииИдентификаторовКонтрагентов(Знач Контрагенты) Экспорт
	
	// При отключенном сервисе сверки изменения идентификаторов не обрабатываем.
	Если НЕ СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаКонтрагент Из Контрагенты Цикл 
		Если ЗначениеЗаполнено(СтрокаКонтрагент.СтарыйИдентификатор) И ЗначениеЗаполнено(СтрокаКонтрагент.НовыйИдентификатор) Тогда
			// Получен новый идентификатор.
			НаборЗаписей = РегистрыСведений.СервисСверкиРасчетовУчастникиСверкиСОбновленнымиID.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.УчастникСверки.Установить(СтрокаКонтрагент.Контрагент);
			
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.УчастникСверки               = СтрокаКонтрагент.Контрагент;
			ЗаписьНабора.ИдентификаторДоОбновления    = СтрокаКонтрагент.СтарыйИдентификатор;
			ЗаписьНабора.ИдентификаторПослеОбновления = СтрокаКонтрагент.НовыйИдентификатор;
			
			НаборЗаписей.Записать();
		ИначеЕсли ЗначениеЗаполнено(СтрокаКонтрагент.СтарыйИдентификатор) И НЕ ЗначениеЗаполнено(СтрокаКонтрагент.НовыйИдентификатор) Тогда
			// Удален идентификатор.
			НаборЗаписей = РегистрыСведений.СервисСверкиРасчетовУстаревшиеIDУчастниковСверки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.УчастникСверки.Установить(СтрокаКонтрагент.Контрагент);
			
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.УчастникСверки = СтрокаКонтрагент.Контрагент;
			ЗаписьНабора.Идентификатор  = СтрокаКонтрагент.СтарыйИдентификатор;
			
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
	// Включим при необходимости рег задание по обработке участников сверки.
	СервисСверкиРасчетов.ОпределитьНеобходимостьОбработкиУчастниковСверки();
	
КонецПроцедуры

// См. БизнесСетьСлужебный.ПриИзмененииИдентификаторовОрганизаций
Процедура ПриИзмененииИдентификаторовОрганизаций(Знач Организации) Экспорт
	
	// При отключенном сервисе сверки изменения идентификаторов не обрабатываем.
	Если НЕ СервисСверкиРасчетов.ИспользуетсяСервисСверкиРасчетов() Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаОрганизация Из Организации Цикл 
		
		НаборЗаписей = РегистрыСведений.СервисСверкиРасчетовУчастникиСверкиСОбновленнымиID.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УчастникСверки.Установить(СтрокаОрганизация.Организация);
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.УчастникСверки               = СтрокаОрганизация.Организация;
		ЗаписьНабора.ИдентификаторДоОбновления    = СтрокаОрганизация.СтарыйИдентификатор;
		ЗаписьНабора.ИдентификаторПослеОбновления = СтрокаОрганизация.НовыйИдентификатор;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	// Включим при необходимости рег задание по обработке участников сверки.
	СервисСверкиРасчетов.ОпределитьНеобходимостьОбработкиУчастниковСверки();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// см. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбменССервисомСверкиРасчетов.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбменССервисомСверкиРасчетовОтправка.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.СервисСверкиРасчетовОбработатьУчастниковСверки.ИмяМетода);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
